Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_interpreter.c
/*
 * tle9012_interpreter.c
 *
 *	Library for TLE9012 Li-Ion battery monitoring and balancing system IC.
 *	See main file Lib_TLE9012.c for how to use guide
 *	Created by R. Santeler @ Infineon 2023
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product").
 * By including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing so
 * agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <ctype.h>
#include <stdlib.h> // includes strtol
#include "tle9012_interpreter.h"
#include "tle9012_registers.h"

//****************************************************************************
// Definitions and Objects for the interpreter system
//****************************************************************************
// De/activate performance debug messages of interpreter system
#define DEBUGPRINTF_INTERP_PERF(p_frm, ...)	//DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_ERROR(p_frm, ...)		DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_INCOMPLETE(p_frm, ...)  //DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_CRC_FAIL(p_frm, ...)  	//DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_INFO(p_frm, ...)		//DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_SUCCESS(p_frm, ...)		//DEBUGPRINTF(p_frm, ##__VA_ARGS__)

typedef enum {
	I_PARSE_READ_RETURN = 0,
	I_PARSE_SUCCESS,
	I_PACKET_INCOMPLETE,
	I_PARSE_FAILED
} interpreterStates;

// Objects for the interpreter system
uint16_t receive_index = 0; 	// The index of the last byte in the receive ring buffer,
								// new bytes will be added after this index
uint16_t interpreter_index = 0; // The index of the last processed byte in the
								// receive ring buffer, will parse the one after this next
InterpreterResult rx_buffer_state = InterpreterSuccess; // The last state of the receive ISR
uint8_t  rx_ring_buffer[RX_RING_BUFFER_SIZE] = {0};
// {0x1E, 0x81, 0x4, 0x50, 0x0, 0x18, 0x0};             // Write commands
// {0x1E,  0x1, 0xB, 0x63, 0x1,  0xB, 0x0, 0x1, 0x59};  // Read command with reply
// {0x1E, 0x1, 0xB, 0x63};                              // Single read command
// {0x1, 0xB, 0x0, 0x1, 0x59};                          // Single read reply

//****************************************************************************
// Inline Functions
//****************************************************************************
static inline void incrementInterpreterIndex(uint16_t* index) {
	(*index)++;
	if (*index > RX_RING_BUFFER_SIZE - 1) {
		(*index) = 0;
	}
}
static inline void decrementInterpreterIndex(uint16_t* index) {
	if ((*index) >= 1)
		(*index)--;
	else
		(*index) = RX_RING_BUFFER_SIZE - 1;
}
static inline void incrementInterpreterIndexBy(uint16_t* index, uint8_t num) {
	for (uint8_t i = 0; i < num; i++) {
		incrementInterpreterIndex(index);
	}
}
static inline uint16_t getInterpreterAbsoluteIndex(uint16_t start_index, uint16_t relative_index) {
	return (start_index + relative_index) % RX_RING_BUFFER_SIZE;
}

//****************************************************************************
// Functions
//****************************************************************************
//****************************************************************************
// resetInterpreter - Resets the indices and first ring buffer element
//****************************************************************************
void resetInterpreter(){
	receive_index = 0;
	interpreter_index = 0;
	rx_ring_buffer[0] = 0;
}

//****************************************************************************
// addToReceiveRingBuffer_tle9012 - Takes a new byte to be added to the uart
// receive ring buffer.
//
// Takes a 8bit data byte
// Returns 0 on success or1 if buffer is full
//****************************************************************************
InterpreterResult addToReceiveRingBuffer_tle9012(uint8_t data) {
	// Determine index of next item
	incrementInterpreterIndex(&receive_index);

	// If the next item index does not collide with currently processed item index...
	if (receive_index != interpreter_index) {
		// ... store received byte item
		rx_ring_buffer[receive_index] = data;

		// Return OK
		//printf("\tAdd %02X to buffer at %d\r\n", data, receive_index);
		return InterpreterSuccess;
	}

	// Revert to last item index
	decrementInterpreterIndex(&receive_index);

