Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_interpreter.c
	// Return FAIL
	//printf("\tAdd  to buffer FAILED: Buffer overflow!!!!\r\n");
	return InterpreterFail;
}


//****************************************************************************
// Returns the number of uninterpreted bytes in the ring buffer
//****************************************************************************
uint16_t getInterpreterIndexDifference() {
	// If the indices match there is no difference
	if (interpreter_index == receive_index) {
		//DEBUGPRINTF("Same\r\n");
		return 0;
	}
	// If the receive index is higher than the interpret index
	// a normal difference can be applied
	else if (receive_index > interpreter_index) {
		//DEBUGPRINTF("Normal\r\n");
		return (receive_index - interpreter_index);
	}
	// If the receive index is lower than the interpret index
	// the leap over must be accounted for
	else if (receive_index < interpreter_index) {
		//DEBUGPRINTF("Over\r\n");
		return ((receive_index + RX_RING_BUFFER_SIZE) - interpreter_index);
	}

	// Should never come here
	return -1;
}


//****************************************************************************
// Return data byte at the over leap correct index inside a package
//****************************************************************************
static inline uint8_t getPackageByte(uint16_t package_start_index, uint16_t relative_index) {
	return rx_ring_buffer[(package_start_index + relative_index) % RX_RING_BUFFER_SIZE];
}


//****************************************************************************
// calcPackageCRC8
// Calculates the crc8 sum direct in rx_ring_buffer at the given start,
// for the given length
//
// Returns the checksum
// TODO get faster code and document reference
//****************************************************************************
unsigned char calcPackageCRC8(uint16_t crc_start_index, uint8_t length) {
	unsigned long crc;
	int i, bit;

	crc = 0xFF;
	for (i = 0; i < length; i++) {
		crc ^= getPackageByte(crc_start_index, i);
		for (bit = 0; bit < 8; bit++) {
			if ((crc & 0x80) != 0) {
				crc <<= 1;
				crc ^= 0x1D;
			}
			else {
				crc <<= 1;
			}
		}
	}

	return (~crc) & 0xFF;
}


//****************************************************************************
// Debug function to display all bytes in buffer
//****************************************************************************
void dumpReceiveBuffer() {
	DEBUGPRINTF("Buffer dump - receive index %d, interpreter index %d: ",
			receive_index, interpreter_index);
	for (int i = 0; i <= RX_RING_BUFFER_SIZE - 1; i++){
		DEBUGPRINTF("0x%02X, ", getPackageByte(0, i));
	}
	DEBUGPRINTF("\r\n");
}

//****************************************************************************
// Used to set error/ready bit and write data to shadow register.
// Checks register index node ID and isSuccessful
// to determine what states shall be set.
//****************************************************************************
static inline void setRegistersStateAndData(uint8_t nodeID, uint8_t regIdx,
		uint16_t data, uint8_t isSuccessful) {
	if (regIdx < NUM_REGISTERS) {
		if (isSuccessful == 1) {
			if (nodeID > 0 && nodeID <= TLE9012_NODES_SIZE) {
				setRegisterCacheDataByIndex_tle9012(nodeID, regIdx, data);
				setRegisterReady_tle9012(nodeID, regIdx, 0);
				resetRegisterError_tle9012(nodeID, regIdx, 0);

			}
			else if (nodeID == ID_FRAME_ID_BROADCAST) {
				DEBUGPRINTF_INFO("\t\t\t\tNodeID %d "
						"detected as Broadcast - write data to every Node\r\n",
						nodeID);
				for (int i = 0; i < TLE9012_NODES_SIZE; i++) {
					setRegisterCacheDataByIndex_tle9012(i+1, regIdx, data);
				}
				setRegisterReady_tle9012(nodeID, regIdx, 1);
				resetRegisterError_tle9012(nodeID, regIdx, 1);
			}
			else {
				DEBUGPRINTF_ERROR("\t\t\t\tNodeID %d is 0 "
						"or exceeded size of NodeArray - Ignoring package\r\n",
						nodeID);
			}
		}
		else {
			if (nodeID > 0 && nodeID <= TLE9012_NODES_SIZE) {
				setRegisterReady_tle9012(nodeID, regIdx, 0);
				setRegisterError_tle9012(nodeID, regIdx, 0);
			}
			else if (nodeID == ID_FRAME_ID_BROADCAST) {
				DEBUGPRINTF_INFO("\t\t\t\tNodeID %d "
						"detected as Broadcast - write data to every Node\r\n",
						nodeID);
				for (int i = 0; i < TLE9012_NODES_SIZE; i++) {
					setRegisterReady_tle9012(nodeID, regIdx, 0);
					setRegisterError_tle9012(nodeID, regIdx, 0);
				}
			}
			else {
				DEBUGPRINTF_ERROR("\t\t\t\tNodeID %d is 0 "
						"or exceeded size of NodeArray - Ignoring package\r\n",
						nodeID);
			}
		}
	}
	else {
		DEBUGPRINTF_ERROR("\t\t\t\tRegister index %d "
				"exceeded number of registers: Ignore message \r\n", regIdx);
	}
}


//****************************************************************************
// Takes the already verified frames of a package (starting with id frame) and
// extracts its components, interprets data, acts based on read or write, checks
// reply fame if needed, converts data, sets ready/error bit and stores result in
// node object. The package index is allowed to overflow the maximum buffer size.
// It will always be corrected because the relative index must be corrected anyway.
// Returns number of bytes that the index must be incremented or 0 if it failed.
//****************************************************************************
uint16_t interpretDataPackage(uint16_t package_index) {
	// Extract node ID and read/write info from "ID Frame"
	DEBUGPRINTF_INFO("\t\t\t\tID Frame at: index=%d+%d, byte=0x%02X\r\n",
			package_index, PACKAGE_ID_FRAME_IDX,
			getPackageByte(package_index, PACKAGE_ID_FRAME_IDX));
	uint8_t id_frame = getPackageByte(package_index, PACKAGE_ID_FRAME_IDX);
	uint8_t nodeID = id_frame & ID_FRAME_ID_MASK;
	uint8_t isWrite = id_frame & ID_FRAME_ISWRITE_MASK;

	// Extract Address from "Address frame"
	uint8_t regAdr = getPackageByte(package_index, PACKAGE_ADR_FRAME_IDX);
	uint8_t regIdx = getRegisterIndexFromAddress(regAdr);

	// Extract data from "Data frame"
	uint16_t data =
			((uint16_t)getPackageByte(package_index,
					PACKAGE_DATA0_FRAME_IDX) << 8) |
					getPackageByte(package_index, PACKAGE_DATA1_FRAME_IDX);

	// If its a write data package check the reply frame, else store the data as read
	if (isWrite) {
		// WRITE PACKAGE: Check reply Frame
		uint8_t reply_frame = getPackageByte(package_index, PACKAGE_W_REPLY_FRAME_IDX);

		// If reply frame reports an error set error bit and return
		uint8_t isSuccessful = 0;
		if (reply_frame == 0) {
			// Store data to shadow register set ready bit and reset error bit
			DEBUGPRINTF_SUCCESS("\t\t\t\tStore write data: "
					"NodeID=%d, RegAdr=0x%02X, Data=0x%04X, Reply=0x%02X\r\n",
					nodeID, regAdr, data, reply_frame);

			// Mark successful - no error
			isSuccessful = 1;
		}
		else if(reply_frame & REPLY_FRAME_CRC_ERROR_MASK){
			// Print debug info about reply frame
			DEBUGPRINTF_ERROR("\t\t\t\tWrite command reply indicated "
					"- CRC checked register error:  NodeID=%d, "
					"RegAdr=0x%02X, ReplyByte=0x%02X (CRC3calc=0x%02X)\r\n",
					nodeID, regAdr, reply_frame,
					calcCRC3((uint16_t)(reply_frame>>3)));
			//dumpReceiveBuffer();

			// Mark not successful - CRC checked wrong
			isSuccessful = 0;
		}
		else if (reply_frame & REPLY_FRAME_REG_ADR_ERROR_MASK) {
			// Print debug info about reply frame
			DEBUGPRINTF_ERROR("\t\t\t\tWrite command reply indicated - "
					"Register address for write command invalid: "
					"NodeID=%d, RegAdr=0x%02X, "
					"ReplyByte=0x%02X (CRC3calc=0x%02X)\r\n",
					nodeID, regAdr, reply_frame,
					calcCRC3((uint16_t)(reply_frame>>3)));
			//dumpReceiveBuffer();

			// Mark not successful - wrong register address
			isSuccessful = 0;
		}
		else if (reply_frame & REPLY_FRAME_GENERAL_FAULT_MASK) {
			// Print debug info about reply frame
			/*DEBUGPRINTF_ERROR("\t\t\t\tWrite command reply indicated - "
					"Fault in general diagnostics register. "
					"Will ignore error: NodeID=%d, RegAdr=0x%02X, "
					"ReplyByte=0x%02X (CRC3calc=0x%02X)\r\n",
					nodeID, regAdr, reply_frame,
					calcCRC3((uint16_t)(reply_frame>>3)));*/
			generalDiagnosticProblemDetected = 1;
			//dumpReceiveBuffer();

