Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_interpreter.c
			/* Mark successful
			 * a replied problem in general diagnostic register
			 * is not recognized as error
			 * (based on information from datasheet
			 * not sure if write command is ok in this case or not TODO)*/
			isSuccessful = 1;
		}
		else {
			// Print debug info about reply frame
			DEBUGPRINTF_ERROR("\t\t\t\tWrite command reply "
					"indicated unknown error: NodeID=%d, RegAdr=0x%02X, "
					"ReplyByte=0x%02X (CRC3calc=0x%02X)\r\n",
					nodeID, regAdr, reply_frame,
					calcCRC3((uint16_t)(reply_frame>>3)));
			//dumpReceiveBuffer();

			// Mark not successful - unknown error can not be distinguished
			isSuccessful = 0;
		}

		// Do not store the data if the reset of a diagnostic register is written
		if(regIdx == GEN_DIAG && isWrite == 1)
			isSuccessful = 0;

		// Write the actual data to register and set error/ready bit
		setRegistersStateAndData(nodeID, regIdx, data, isSuccessful);

		// Return size of write command (there are no write packages)
		// to increase to interpreter index
		return SIZE_WRITE_COMMAND;
	}
	else {
		// READ PACKAGE:
		DEBUGPRINTF_SUCCESS("\t\t\t\tStore read data: "
				"NodeID=%d, RegAdr=0x%02X, Data=0x%04X\r\n",
				nodeID, regAdr, data);
		// Store data to shadow register set ready bit and reset error bit
		setRegistersStateAndData(nodeID, regIdx, data, 1);

		// Return size of read package to increase
		// the interpreter index to next package
		return SIZE_READ_PACKAGE;
	}
}


//****************************************************************************
// Takes the package start index and the size of the data that shall be crc8
// checked and compares the result with the should-be CRC sum at the next byte.
// Returns true if crc matched and false if not
//****************************************************************************
static inline uint8_t checkDataPackageCRC(uint16_t index_crc_start,
		uint8_t crc_data_size) {
	DEBUGPRINTF_INFO("\t\t\tCalc CRC from index %d for "
			"%d bytes = 0x%02X. Compare to 0x%02X at index %d\r\n",
			index_crc_start, crc_data_size,
			calcPackageCRC8(index_crc_start, crc_data_size),
			getPackageByte(index_crc_start, crc_data_size),
			(index_crc_start + crc_data_size) % RX_RING_BUFFER_SIZE);
	return calcPackageCRC8(index_crc_start, crc_data_size) ==
			getPackageByte(index_crc_start, crc_data_size);
}


//****************************************************************************
// Manages the Interpreter - Checks if whole data packages were receive to the
// ring buffer, interprets the packages. The interpreted data will be stored in
// the shadow registers and post-processed if needed.
// Additionally the ready bit is set after data is written successfully.
//****************************************************************************
void tle9012_manageInterpreter() {
	//uint64_t debugStartTime = TIMER_COUNTER_1MS;
	DEBUGPRINTF_INFO("\r\nStart manageInterpreter at "
			"interpreter_index=%d and receive_index=%d\r\n",
			interpreter_index, receive_index);

	// Check last state of the RX buffer
	if (rx_buffer_state != InterpreterSuccess) {
		DEBUGPRINTF("\tUART RX buffer overflow!\r\n");
	}

	// Get number of bytes in buffer
	uint16_t numBytesInBuffer = getInterpreterIndexDifference();
	//uint16_t initialNumBytesInBuffer = numBytesInBuffer;

	// Initial interpreter state
	interpreterStates iState;

	// Debug
	if (!(numBytesInBuffer >= SIZE_MINIMAL_RX_SIZE)) {
		DEBUGPRINTF_INFO("\r\n\tSKIPED interpreter loop - bytes "
				"in fifo MIN=%d, IS=%d ---\r\n\r\n",
				SIZE_MINIMAL_RX_SIZE, numBytesInBuffer); }

	// Interpret ring buffer as long as there is the minimum size
	// of any message in buffer or a bigger incomplete message is found
	while (numBytesInBuffer >= SIZE_MINIMAL_RX_SIZE) {
		DEBUGPRINTF_INFO("\r\n\tSTART interpreter loop - bytes "
				"in fifo MIN=%d, IS=%d ---\r\n",
				SIZE_MINIMAL_RX_SIZE, numBytesInBuffer);

		// The interpreter_index points to the last processed byte
		// in order to make parts of the code simpler and faster.
		// But during the interpreter run the actual index of
		// the first new byte is needed.
		// Therefore it is safely incremented here and
		// used throughout the interpreter routine.
		uint16_t next_interpreter_index =
				getInterpreterAbsoluteIndex(interpreter_index, 1);

		// Reset parse state to tryParsing
		iState = I_PARSE_READ_RETURN;

		// TRY COMMAND PARSE:
		// If "Synchronization Frame" is detected at first byte:
		// New data package is assumed -> check if it is by checking crc sum
		if (getPackageByte(next_interpreter_index, 0) == FRAME_SYNC) {
			DEBUGPRINTF_INFO("\t\tAssumed SYNC frame at %d: "
					"Check CRC to check if this is a command\r\n",
					next_interpreter_index);
			// If read detected (isWrite bit is not set)
			if ((getPackageByte(next_interpreter_index, 1) & ID_FRAME_ISWRITE_MASK) == 0) {
				DEBUGPRINTF_INFO("\t\t\tRead command?\r\n");
				// If remaining bytes in buffer are below read command size
				// stop this loop and try next time
				if (numBytesInBuffer < SIZE_READ_COMMAND) {
					DEBUGPRINTF_INCOMPLETE("\t\t\t\tMessage read com incomplete "
							"MIN=%d IS=%d (LAST=0x%02X)\r\n",
							SIZE_READ_COMMAND, numBytesInBuffer,
							getPackageByte(receive_index, 0));
					iState = I_PACKET_INCOMPLETE;
					// Stop loop and hope that next time the whole message is in buffer
					break;
				}
				// Else if CRC8 of this and next 2 bytes
				// (sync, nodeID, regAdr) match with 4th byte (CRC8 byte)
				else if (checkDataPackageCRC(next_interpreter_index, 3)) {
					// Set interpreter index to after this command
					// the replies will be read in "Reply package is assumed"
					incrementInterpreterIndexBy(&interpreter_index, SIZE_READ_COMMAND);
					next_interpreter_index =
							getInterpreterAbsoluteIndex(interpreter_index, 1);
					DEBUGPRINTF_INFO("\t\t\t\tCRC matches = "
							"read command confirmed - "
							"moving interpreter index by %d to %d and try parse\r\n",
							SIZE_READ_COMMAND, interpreter_index);
					// State is still tryParsing
					// next section, try reply parse will become active
				}
				// Else: If the CRC is wrong there is either a invalid package or
				// a data package with a device id similar to the sync frame.
				// In this case the next section will try to parse it
				// as data package because the state still is on I_PARSE_READ_RETURN.
				else {
					DEBUGPRINTF_CRC_FAIL("\t\t\t\tCRC does not match - "
							"must be a data package or a invalid command \r\n");
				}
			}
			// Else write detected (isWrite bit is set)
			else {
				DEBUGPRINTF_INFO("\t\t\tWrite command?\r\n");
				// If remaining bytes in buffer are below write command size
				// stop this loop and try next time
				if (numBytesInBuffer < SIZE_WRITE_COMMAND) {
					DEBUGPRINTF_INCOMPLETE("\t\t\t\tMessage write com "
							"incomplete MIN=%d IS=%d (LAST=0x%02X)\r\n",
							SIZE_WRITE_COMMAND, numBytesInBuffer,
							getPackageByte(receive_index, 0));
					iState = I_PACKET_INCOMPLETE;
					// Stop loop and hope that next time the whole message is in buffer
					break;
				}
				// Else if CRC8 of this and next 4 bytes
				// (sync, nodeID, regAdr, data1, data0) match with 6th byte (CRC8 byte)
				else if (checkDataPackageCRC(next_interpreter_index, 5)) {
					DEBUGPRINTF_INFO("\t\t\t\tCRC matches = "
							"write command confirmed - parse package "
							"and increment index\r\n");
					uint8_t package_size =
							interpretDataPackage(interpreter_index + 2);
					// Parse was successful, no further processing
					// of this data needed - set parse state to: I_PARSE_SUCCESS
					if (package_size > 0) {
						iState = I_PARSE_SUCCESS;
						// Set interpreter index to after this command
						incrementInterpreterIndexBy(&interpreter_index,
								package_size);
						DEBUGPRINTF_SUCCESS("\t\t\t\tParse successful, "
								"moving interpreter index by %d to %d (0x%02X)\r\n",
								package_size, interpreter_index,
								getPackageByte(interpreter_index, 0));
					}
					else {
						DEBUGPRINTF_INFO("\t\t\t\tParse failed\r\n");
						iState = I_PARSE_FAILED;
					}
				}
				// Else: If the CRC is wrong this must be a invalid package.
				else {
					DEBUGPRINTF_CRC_FAIL("\t\t\t\tCRC does not match - "
							"must be a invalid command \r\n");
					// TODO: Test if code works if the state is set to
					// failed parse here. Should skip tryParsing
				}
			}
		}

		// TRY REPLY PARSE: If - Reply package is assumed:
		// If Package parse state is not successParse yet and
		// CRC8 of this and next 3 bytes (nodeID, regAdr, data0, data1)
		// match with 5th byte (CRC8 byte)
		if (iState == I_PARSE_READ_RETURN) {
			DEBUGPRINTF_INFO("\t\tAssumed reply: Try to parse \r\n");
			// Refresh number of bytes in buffer
			numBytesInBuffer = getInterpreterIndexDifference();
			// If remaining bytes in buffer are below reply size stop this loop and try next time
			if (numBytesInBuffer < SIZE_READ_PACKAGE) {
				DEBUGPRINTF_INCOMPLETE("\t\t\tMessage incomplete "
						"MIN=%d IS=%d (LAST=0x%02X)\r\n",
						SIZE_READ_PACKAGE, numBytesInBuffer,
						getPackageByte(receive_index, 0));
				iState = I_PACKET_INCOMPLETE;
				// Stop loop and hope that next time the whole message is in buffer
				break;
			}
			// If CRC8 of this and next 3 bytes
			// (nodeID, regAdr, data0, data1) match with 5th byte (CRC8 byte)
			else if (checkDataPackageCRC(next_interpreter_index, 4)) {
				DEBUGPRINTF_INFO("\t\t\tCRC matches - "
						"parse package and increment index \r\n");
				uint8_t package_size =
						interpretDataPackage(next_interpreter_index);
				// Parse was successful, no further processing of this data needed
				// set parse state to: I_PARSE_SUCCESS
				if (package_size > 0) {
					iState = I_PARSE_SUCCESS;
					// Set interpreter index to after this command
					incrementInterpreterIndexBy(&interpreter_index, package_size);
					DEBUGPRINTF_SUCCESS("\t\t\t\tParse successful, "
							"moving interpreter index by %d to %d (0x%02X)\r\n",
							package_size, interpreter_index,
							getPackageByte(interpreter_index, 0));
				}
				else {
					DEBUGPRINTF_INFO("\t\t\t\tParse failed\r\n");
					iState = I_PARSE_FAILED;
				}
			}
			// Else: If the CRC is still wrong the package is invalid.
			// In this case the next section will discard all bytes
			// until the sync frame is found.
			else {
				DEBUGPRINTF_CRC_FAIL("\t\t\tCRC does not match - must be invalid data\r\n");
				iState = I_PARSE_FAILED;
			}
		}

