Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_interpreter.c
		// DISCARD UNPARSABLE BYTES: If parse not successful invalid data assumed and ignored
		if (iState == I_PARSE_FAILED) {
			//DEBUGPRINTF_INFO("\t\tDiscard invalid data until SYNC frame is found\r\n");
			//// Refresh number of bytes in buffer
			//numBytesInBuffer = getInterpreterIndexDifference();
			//// Increment interpreter index until "Synchronization Frame" is found or
			//// end of buffer is reached. This ignores all broken data
			/*for(uint16_t i = 0; i <= numBytesInBuffer; i++){
				// If synchronization frame is found at any point
				// except the first (could be initial SYNC frame), stop
				if(i > 0 && getPackageByte(interpreter_index+1, 0) == FRAME_SYNC){
					DEBUGPRINTF_INFO("\t\t\tFound SYNC frame\r\n");
					break; // Todo: Test if "continue;" works also!
				}
				// If end of recieved data is reached, stop
				if(interpreter_index == receive_index){
				    DEBUGPRINTF_INFO("\t\t\tDiscarded all bytes currently in buffer\r\n");
					break;
				}
				DEBUGPRINTF_ERROR("\t\t\tDiscard byte index %d: 0x%02X \r\n",
						interpreter_index+1, getPackageByte(interpreter_index+1, 0));
				// Increment interpreter index
				incrementInterpreterIndex(&interpreter_index);
			}*/
			// Note: The above loop cannot handle additional bytes between
			// read responses or crc errors in responses.
			// However it would allow for faster processing
			// If end of received data is reached, stop
			if (interpreter_index == receive_index) { break; }
			DEBUGPRINTF_ERROR("\t\t\tDiscard byte index %d: 0x%02X \r\n",
					next_interpreter_index, getPackageByte(interpreter_index, 1));
			// Increment interpreter index
			incrementInterpreterIndex(&interpreter_index);
		}

		// Refresh number of bytes in buffer
		numBytesInBuffer = getInterpreterIndexDifference();

		// Check if data received during loop
		//if (numBytesInBuffer > initialNumBytesInBuffer)
		//	DEBUGPRINTF_ERROR("\tnumBytesInBuffer increased during interp, ISR RX?\r\n");
	}

	DEBUGPRINTF_INTERP_PERF("manageInterpreter took %ld ms\r\n",
			(uint32_t)(TIMER_COUNTER_1MS-debugStartTime));
}
